n = N;
i = 1;
x[i] = <初值>;      // 初始化或取第一个可能值



while (1)           // 重复各种可能
{
    fg = 1;         // 满足约束条件标志

    /*
    *   检测约束
    */
    for (k = i - 1; k >= 1; k--)    
        if ( <不满足约束条件> )
            fg = 0;                     


    /*
    *   输出一个解
    *   概率很小，这里可以先行忽略
    */
    if (fg && <满足全部约束条件>)       
        cout << x;




    /*
    *   扩充新元素
    */
    if (fg && i < n)                
    {
        i++;
        x[i] = <取新值>;
        continue;
    }




    /*
    *   回溯
    */
    while (x[i] == <回溯点> && i > 1)  
        i--;

    

    if (i == 1 && a[i] == n)            // 试探结束
        break;
    else
        x[i]++;                         // 试探下一条路径
}